/**
 * @description
 * <span style='color:red;font-weight:bold'>通用正则校验</span>
 * |key|value|备注
 * |---|---|---
 * |Reg.phone|/^1\d{10}$/|手机号
 * |Reg.personname|/^[\u4e00-\u9fa5_a-zA-Z0-9-]{2,16}$/|用户名
 * |Reg.longtitude|/^(\-\|\+)?(((\d\|[1-9]\d\|1[0-7]\d\|0{1,3})\.\d{0,15})\|(\d\|[1-9]\d\|1[0-7]\d\|0{1,3})\|180\.0{0,15}\|180)$/|经度
 * |Reg.latitude|/^(\-\|\+)?([0-8]?\d{1}\.\d{0,15}\|90\.0{0,15}\|[0-8]?\d{1}\|90)$/|纬度
 */
export const Reg = {
  phone: /^1\d{10}$/, // 手机号
  personname: /^[\u4e00-\u9fa5_a-zA-Z0-9-]{2,16}$/, // 姓名
  longtitude: /^(\-|\+)?(((\d|[1-9]\d|1[0-7]\d|0{1,3})\.\d{0,15})|(\d|[1-9]\d|1[0-7]\d|0{1,3})|180\.0{0,15}|180)$/, // 经度
  latitude: /^(\-|\+)?([0-8]?\d{1}\.\d{0,15}|90\.0{0,15}|[0-8]?\d{1}|90)$/ // 维度
}